app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("created_at", "edate", "organizer", "sponsers", "subject", "updated_at", "venue") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", "2014-12-13 10:04:36.497651"], ["edate", "2014-12-13"], ["organizer", "hi"], ["sponsers", "hi"], ["subject", "hi"], ["updated_at", "2014-12-13 10:04:36.497651"], ["venue", "hi"]]